In [7]:
import pandas as pd

file_path = "../data/1comments.h5"
df = pd.read_hdf(file_path, key='df')
df.sample(3)

,id,createdAt,userId,userCreatedAt,classYear,universityId,country,universityName,parentId,questionId,comment,review,likes,dislikes
6330,9155,2022-03-29 15:10:12.704096+00:00,7885,2021-05-01 15:40:23.354000+00:00,Year 5,2625,United Kingdom,University of Birmingham,NaN,5020,Surely the parity is 4 - the stillbirth at 28w...,False,4.0,1.0
7417,10566,2022-05-10 16:39:42.928534+00:00,15556,2021-12-17 11:52:52.421000+00:00,Year 5,2643,United Kingdom,University of Glasgow,2452.0,963,@Anon 23/01/22: I think the OP's question was ...,False,9.0,0.0
19408,24660,2023-05-15 16:35:29.721368+00:00,20900,2022-04-27 11:30:35.124682+00:00,Year 4,2670,United Kingdom,University of Southampton,NaN,8929,this would present way earlier i swear,False,6.0,1.0

## Processing DataFrame

In [8]:
f"Date range of comments: {df.iat[0, 1]} to {df.iat[-1, 1]}"

'Date range of comments: 2021-03-25 11:22:56.133000+00:00 to 2023-12-20 20:28:56.024306+00:00'

In [9]:
blank_comments = df.comment.str.len() > 2
blank_comments.value_counts()

comment
True     30157
False      155
Name: count, dtype: int64

In [12]:
df = df.loc[blank_comments]
df.shape

(30157, 14)

In [15]:
df['likes'] = df['likes'].fillna(0).astype(int)
df['dislikes'] = df['dislikes'].fillna(0).astype(int)

In [17]:
save_path = "../data/comments_clean.h5"
df.to_hdf(save_path, key='df', mode='w')

/var/folders/lk/lhmn07j501l6rng06tjrl8cm0000gn/T/ipykernel_69658/223130718.py:2: PerformanceWarning:
your performance may suffer as PyTables will pickle object types that it cannot
map directly to c-types [inferred_type->mixed,key->block4_values] [items->Index(['classYear', 'country', 'universityName', 'comment', 'review'], dtype='object')]

  df.to_hdf(save_path, key='df', mode='w')